benchmark_no_prefetch.txt
/home/max509/Documents/education/projects/rocksdb/cmake-build-relwithdebinfo/db_bench --benchmarks=fillrandom,flush,readrandom --disable_wal true --allow_concurrent_memtable_write=false --writes 100000 --reads 5000000 --cache_size 536870912 --cache_index_and_filter_blocks true --seed 42
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
RocksDB:    version 9.5.0
Date:       Sat Jul 13 18:38:42 2024
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     100 bytes each (50 bytes after compression)
Entries:    1000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    110.6 MB (estimated)
FileSize:   62.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
CPU:        16 * AMD Ryzen 7 4800H with Radeon Graphics
CPUCache:   512 KB
DB path: [/tmp/rocksdbtest-1000/dbbench]
fillrandom   :       2.256 micros/op 443276 ops/sec 0.226 seconds 100000 operations;   49.0 MB/s
flush memtable
DB path: [/tmp/rocksdbtest-1000/dbbench]
readrandom   :       2.061 micros/op 485313 ops/sec 10.303 seconds 5000000 operations;    5.1 MB/s (476016 of 5000000 found)


Process finished with exit code 0